PURE_SCORE_RELATIONSHIP = {
    "优": 92,
    "优秀": 92,
    "良": 85,
    "良好": 85,
    "中": 75,
    "中等": 75,
    "及格": 65,
    "不及格": 0,
}

BEND_RELATIONSHIP_1 = {
    100: 5.0,
    96: 4.8,
    93: 4.5,
    90: 4.0,
    86: 3.8,
    83: 3.5,
    80: 3.0,
    76: 2.8,
    73: 2.5,
    70: 2.0,
    66: 1.8,
    63: 1.5,
    60: 1.0,
    0: 0.0,
}

BEND_RELATIONSHIP_2 = {
    "优": 4.0,
    "优秀": 4.0,
    "良": 3.5,
    "良好": 3.5,
    "中": 2.5,
    "中等": 2.5,
    "及格": 1.5,
    "不及格": 0.0,
}

PDF_TITLE_KEYWORD = "南京信息工程大学本科生学业成绩表"
PDF_STOP_KEYWORD = "以下空白"

